app/views/scans/show.html.erb

          <div class="bg-blue-50 text-blue-700 px-6 py-2 rounded-full font-medium animate-pulse">
            <%= pluralize(@scan.comments.count, 'commento', 'commenti') %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."scan_id" = ? ORDER BY "comments"."created_at" DESC  [["scan_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."scan_id" = ?  [["scan_id", 1]]

        <div class="space-y-4" id="comments-list">
          <% if @scan.comments.any? %>
---
SELECT 1 AS one FROM "comments" WHERE "comments"."scan_id" = ? LIMIT ?  [["scan_id", 1], ["LIMIT", 1]]