app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_current_user
      if clerk_session
        @current_user = Clerk::User.find(clerk_session["user_id"])