app/controllers/auth0_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alexmaone8@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."auth0_uid" = ? LIMIT ?  [["auth0_uid", "github|117100987"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "auth_provider" = ?, "auth0_uid" = ? WHERE "users"."id" = ?  [["updated_at", "2025-01-12 10:51:38.627399"], ["auth_provider", "auth0"], ["auth0_uid", "github|117100987"], ["id", 1]]
---
  def callback
    auth_info = request.env['omniauth.auth']
    Rails.logger.debug "Auth Info: #{auth_info.inspect}"  # Debug log

    # Estrai i dati principali
    auth0_uid = auth_info['uid']
    email = auth_info['info']['email']
    username = auth_info['info']['nickname']

    # Trova utenti con email o UID corrispondente
    local_user = User.find_by(email: email)
    auth0_user = User.find_by(auth0_uid: auth0_uid)

    if auth0_user
      # L'utente Auth0 esiste già
      Rails.logger.debug "Auth0 user found: #{auth0_user.inspect}"
      login(auth0_user)
    elsif local_user
      # Esiste un utente locale con la stessa email
      if local_user.auth0_uid.nil?
        # Fonde l'account locale con quello Auth0
        Rails.logger.debug "Merging local user with Auth0: #{local_user.inspect}"
        local_user.update(auth0_uid: auth0_uid, auth_provider: 'auth0', username: username)

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "auth_provider", "auth0_uid") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
    else
      # Nessun utente trovato, crea un nuovo account
      Rails.logger.debug "Creating new Auth0 user..."
      user = User.create(
        email: email,
        username: username,
        auth0_uid: auth0_uid,
        auth_provider: 'auth0',
        password_digest: SecureRandom.hex(10) # Genera una password casuale
      )