app/controllers/auth0_controller.rb

  def callback
    auth_info = request.env['omniauth.auth']
    user = User.find_or_create_by(email: auth_info['info']['email']) do |u|
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "auth_provider", "auth0_uid") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"