app/controllers/comments_controller.rb

  def create
    @scan = Scan.find(params[:scan_id])
    @comment = current_user.comments.build(comment_params)
    @comment.scan = @scan

    respond_to do |format|
      if @comment.save
---
SELECT "scans".* FROM "scans" WHERE "scans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "created_at", "updated_at", "scan_id", "likes_count", "dislikes_count") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["content", "Test comment"], ["user_id", 1], ["created_at", "2025-02-08 16:52:38.695484"], ["updated_at", "2025-02-08 16:52:38.695484"], ["scan_id", 1], ["likes_count", 0], ["dislikes_count", 0]]