app/controllers/password_resets_controller.rb

    def create
        if (user = User.find_by(email: params[:email]))
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alexmaone8@gmail.com"], ["LIMIT", 1]]

    def update
        if @user.update(password_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-12-05 20:48:30.210507"], ["id", 11]]