app/controllers/passwords_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-12-05 18:55:57.401750"], ["id", 15]]
---
    def update
        if current_user.update(password_params)