app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "auth_provider", "auth0_uid") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.auth_provider = 'local'
    @user.username = @user.email.split('@').first

    respond_to do |format|
      if @user.save