app/controllers/scans_controller.rb

  def index
    @scans = Scan.all
---
SELECT "scans".* FROM "scans"