app/controllers/scans_controller.rb

SELECT "scans".* FROM "scans" WHERE "scans"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @scan = Scan.find(params[:id])

INSERT INTO "scans" ("file_name", "file_type", "hashcode", "file_size", "upload_date", "vote_up", "vote_down", "created_at", "updated_at", "scan_result", "file_data", "user_id", "vt_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @scan = Scan.new(scan_params)

    respond_to do |format|
      if @scan.save

SELECT "votes".* FROM "votes" WHERE "votes"."scan_id" = ? AND "votes"."user_id" = ? LIMIT ?  [["scan_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."scan_id" = ? LIMIT ?  [["user_id", 1], ["scan_id", 1], ["LIMIT", 1]]
UPDATE "scans" SET "vote_up" = COALESCE("vote_up", 0) + ? WHERE "scans"."id" = ?  [["vote_up", 1], ["id", 1]]
---
  def upvote
    vote = @scan.votes.find_or_initialize_by(user: current_user)

    if vote.new_record? || vote.vote_type != 'up'
      Vote.transaction do
        if vote.persisted?
          @scan.decrement!("vote_#{vote.vote_type}") if vote.vote_type.present?

SELECT "scans".* FROM "scans" WHERE "scans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_scan
      @scan = Scan.find(params[:id])