app/controllers/scans_controller.rb

SELECT "scans".* FROM "scans" WHERE "scans"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_scan
      @scan = Scan.find(params[:id])